Revit 2027 API
InitialFluxIntensity(InitialFluxIntensity) Constructor
 Creates a copy of the given initial flux intensity object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InitialFluxIntensity(
	InitialFluxIntensity other
)
Public Sub New (
	other As InitialFluxIntensity
)
public:
InitialFluxIntensity(
	InitialFluxIntensity^ other
)
new :
        other : InitialFluxIntensity -> InitialFluxIntensity
Parameters
other InitialFluxIntensity
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InitialFluxIntensity Class
InitialFluxIntensity Overload
Autodesk.Revit.DB.Lighting Namespace